
<?php

/*

Each script specifies 64 characters, some may come with their own puctuation, some may not even have casing.
Runes: Dotted variants as capital?
Hangeul: Concatenation of jamo should yield composed syllables - somehow.
Kana: Will be a find-replace system, cause syllabic.

*/


$latin      = [' ','a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z','\'','-','.',',','?',
               '!','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z','\'',':',';','"','/'];
               
$cyrillic   = [' ','а','б','ц','д','е','ф','г','х','и','щ','к','л','м','н','о','п','ч','р','с','т','у','в','ш','ж','ы','з','ъ' ,'-','.',',','?',
               '!','А','Б','Ц','Д','Е','Ф','Г','Х','И','Щ','К','Л','М','Н','О','П','Ч','Р','С','Т','У','В','Ш','Ж','Ы','З','Ъ' ,':',';','"','/'];
               
$greek      = [' ','α','β','θ','δ','ε','φ','γ','χ','ι','ξ','κ','λ','μ','ν','ο','π','ψ','ρ','σ','τ','ω','ύ','ώ','η','υ','ζ','`' ,'-','.',',','?',
               '!','Α','Β','Θ','Δ','Ε','Φ','Γ','Χ','Ι','Ξ','Κ','Λ','Μ','Ν','Ο','Π','Ψ','Ρ','Σ','Τ','Ω','Ύ','Ώ','Η','Υ','Ζ','`' ,':',';','"','/'];
               
$runic      = [' ','ᚨ','ᛒ','ᚦ','ᛞ','ᛖ','ᚠ','ᚷ','ᚺ','ᛁ','ᛃ','ᚴ','ᛚ','ᛗ','ᚾ','ᛟ','ᛕ','ᛩ','ᚱ','ᛋ','ᛏ','ᚢ','ᚡ','ᚹ','ᛪ','ᚣ','ᛎ','ᛌ' ,'-','.',',','?',
               '!','ᚨ','ᛒ','ᚦ','ᛞ','ᛖ','ᚠ','ᚷ','ᚺ','ᛁ','ᛃ','ᚴ','ᛚ','ᛗ','ᚾ','ᛟ','ᛕ','ᛩ','ᚱ','ᛋ','ᛏ','ᚢ','ᚡ','ᚹ','ᛪ','ᚣ','ᛎ','ᛌ' ,':',';','"','/'];

$shavian    = [' ','𐑭','𐑚','𐑔','𐑛','𐑻','𐑓','𐑜','𐑙','𐑦','𐑡','𐑒','𐑤','𐑥','𐑯','𐑪','𐑐','𐑼','𐑮','𐑕','𐑑','𐑵','𐑝','𐑢','𐑖','𐑘','𐑟','𐑣' ,'-','.',',','?',
               '!','𐑭','𐑚','𐑔','𐑛','𐑻','𐑓','𐑜','𐑙','𐑦','𐑡','𐑒','𐑤','𐑥','𐑯','𐑪','𐑐','𐑼','𐑮','𐑕','𐑑','𐑵','𐑝','𐑢','𐑖','𐑘','𐑟','𐑣' ,':',';','"','/'];
               
$glagolitic = [' ','ⰰ','ⰱ','ⱌ','ⰴ','ⰵ','ⱇ','ⰳ','ⱈ','ⰻ','ⱋ','ⰽ','ⰾ','ⰿ','ⱀ','ⱁ','ⱂ','ⱍ','ⱃ','ⱄ','ⱅ','ⱆ','ⰲ','ⱎ','ⰶ','ⱛ','ⰸ','ⱏ','-','.',',','?',
               '!','Ⰰ','Ⰱ','Ⱌ','Ⰴ','Ⰵ','Ⱇ','Ⰳ','Ⱈ','Ⰻ','Ⱋ','Ⰽ','Ⰾ','Ⰿ','Ⱀ','Ⱁ','Ⱂ','Ⱍ','Ⱃ','Ⱄ','Ⱅ','Ⱆ','Ⰲ','Ⱎ','Ⰶ','Ⱛ','Ⰸ','Ⱏ',':',';','"','/'];               
               
$hangeul    = ['　','ㅏ','ㅃ','ㅈ','ㄸ','ㅔ','ㅍ','ㄲ','ㅎ','ㅣ','ㅊ','ㄱ','ㅇ','ㅁ','ㄴ','ㅗ','ㅂ','ㅋ','ㄹ','ㅅ','ㄷ','ㅜ','ㅞ','ㅝ','ㅌ','ㅖ','ㅆ','ᇫ','－','。','、','？',
               '！','ㅏ','ㅃ','ㅈ','ㄸ','ㅔ','ㅍ','ㄲ','ㅎ','ㅣ','ㅊ','ㄱ','ㅇ','ㅁ','ㄴ','ㅗ','ㅂ','ㅋ','ㄹ','ㅅ','ㄷ','ㅜ','ㅞ','ㅝ','ㅌ','ㅖ','ㅆ','ᇫ','：','；','＂','／'];
               
$bopomofo   = ['　','ㄚ','ㄅ','ㄘ','ㄉ','ㄜ','ㄈ','ㄍ','ㄏ','ㄧ','ㄐ','ㄎ','ㄌ','ㄇ','ㄋ','ㄛ','ㄆ','ㄑ','ㄖ','ㄙ','ㄊ','ㄨ','ㄪ','ㄡ','ㄒ','ㄟ','ㄗ','ㄝ','・','。','、','？',
               '！','ㄚ','ㄅ','ㄘ','ㄉ','ㄜ','ㄈ','ㄍ','ㄏ','ㄧ','ㄐ','ㄎ','ㄌ','ㄇ','ㄋ','ㄛ','ㄆ','ㄑ','ㄖ','ㄙ','ㄊ','ㄨ','ㄪ','ㄡ','ㄒ','ㄟ','ㄗ','ㄝ','：','；','＂','／'];

$olditalic  = [' ','𐌀','𐌁','𐌈','𐌃','𐌄','𐌅','𐌂','𐌇','𐌉','𐌜','𐌊','𐌋','𐌌','𐌍','𐌏','𐌐','𐌒','𐌓','𐌔','𐌕','𐌖','𐌚','𐌞','𐌑','𐌝','𐌆','𐌙','-','.',',','?',
               '!','𐌀','𐌁','𐌈','𐌃','𐌄','𐌅','𐌂','𐌇','𐌉','𐌜','𐌊','𐌋','𐌌','𐌍','𐌏','𐌐','𐌒','𐌓','𐌔','𐌕','𐌖','𐌚','𐌞','𐌑','𐌝','𐌆','𐌙',':',';','"','/'];
               
$antidys    = [' ','ᐱ','ᗱ','ᑕ','ᑐ','ᗴ','ᔓ','ᑲ','ᔕ','｜','ᒧ','ᑉ','L','ᗰ','ᑎ','◯','ᑭ','ᑫ','ᒥ','ᔑ','ᒣ','ᑌ','ᐯ','ᗯ','ᑯ','ᐳ','ᔐ','\'','-','.',',','?',
               '!','ᐱ','ᗱ','ᑕ','ᑐ','ᗴ','ᔓ','ᑲ','ᔕ','｜','ᒧ','ᑉ','L','ᗰ','ᑎ','◯','ᑭ','ᑫ','ᒥ','ᔑ','ᒣ','ᑌ','ᐯ','ᗯ','ᑯ','ᐳ','ᔐ','\'',':',';','"','/'];
               
// coptic, deseret, devanagari, armenian, georgian, lycian, carian, gothic, ugaritic, aramaic, palmyerene, nabatean, phoenician, lydian, old N/S arabian, old turkic, yezidi, chorasmian

// Right-to-left scripts (confusing)
               
$oldhungarian = [' ', '𐲀','𐲂','𐲄','𐲇','𐲉','𐲌','𐲍','𐲏','𐲐','𐲆','𐲓','𐲖','𐲘','𐲙','𐲛','𐲠','𐲕','𐲢','𐲥','𐲦','𐲪','𐲮','𐲭','𐲤','𐲒','𐲯','𐲣' ,'-','.',',','?',
               '!', '𐲀','𐲂','𐲄','𐲇','𐲉','𐲌','𐲍','𐲏','𐲐','𐲆','𐲓','𐲖','𐲘','𐲙','𐲛','𐲠','𐲕','𐲢','𐲥','𐲦','𐲪','𐲮','𐲭','𐲤','𐲒','𐲯','𐲣' ,':',';','"','/'];

// Some Latin to restore directionality

$scripts = [
    'latin' => $latin, 
    'cyrillic' => $cyrillic, 
    'greek' => $greek, 
    'runic' => $runic, 
    'shavian' => $shavian, 
    'glagolitic' => $glagolitic, 
    'hangeul' => $hangeul, 
    'bopomofo' => $bopomofo, 
    'olditalic' => $olditalic,
    'antidys' => $antidys,
    'oldhungarian' => $oldhungarian
];
$scriptNames = array_keys($scripts);


